<?php
//定义常量

//api地址
define("LIVE_API", "https://plive.48.cn/livesystem/api/live/v1/memberLivePage");
define("OPENLIVE_API", "https://plive.48.cn/livesystem/api/live/v1/openLivePage");
define("LIVEINFO_API", "https://plive.48.cn/livesystem/api/live/v1/getLiveOne");

//直播分享地址前缀
define("LIVE_SHARE", "https://h5.48.cn/2017appshare/memberLiveShare/index.html?id=");

//图片、弹幕服务器
define("LIVE_PIC", "https://source.48.cn");

//直播数据表打印顺序
$order=array(
	"memberId",
	"title",
	"subTitle",
	"liveType",
	"startTime",
	"picPath",
	"liveId",
	"streamPath",
	"lrcPath",
	"picLoopTime",
	"screenMode",
);
$order_open=array(
	"title",
	"subTitle",
	"isReview",
	"startTime",
	"picPath",
	"streamPathHd",
	"streamPathLd",
	"streamPath"
);

//获取直播、录播json数据
function live_get ($limit='100',$lasttime='0',$groupId='0',$memberId='0',$type='0',$api=LIVE_API,$giftUpdTime='1498211389003')
{
$data = array(
	"lastTime" => $lasttime,	//从此刻起获取之前的直播，毫秒时间戳
	"groupId" => $groupId,	//xxx48组
	"type" => $type,
	"memberId" => $memberId,	//成员Id
	"giftUpdTime" => $giftUpdTime,	//礼物更新时间，毫秒时间戳
	"limit" => $limit	//最多多少条
	);                              
$data_string = json_encode($data);
$ch = curl_init($api);
curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
curl_setopt($ch, CURLOPT_POSTFIELDS, $data_string);
curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
curl_setopt($ch, CURLOPT_HTTPHEADER, array(      
    'os: android ',
    'version: 5.0.1',   
    'Content-Type: application/json',
    'Content-Length: ' . strlen($data_string)) 
);
$result = curl_exec($ch);
return $result;
}

//获取公演直播、录播json数据
/* {
   $ "isReview": 0,
   $ "groupId": 0,
   ** "userId": 0,
   ** "lastGroupId": 0,
   $"lastTime": 0,
   ** "type": 0,
   ** "giftUpdTime": 1498211389003,
   $ "limit": 20
} */
function openlive_get ($limit='100',$lasttime='0',$groupId='0',$isreview='1',$api=OPENLIVE_API,$giftUpdTime='1498211389003')
{
$data = array(
	"isReview" => $isreview,	//是否为录播
	"lastTime" => $lasttime,	//从此刻起获取之前的直播，毫秒时间戳
	"groupId" => $groupId,	//xxx48组
	"giftUpdTime" => $giftUpdTime,	//礼物更新时间，毫秒时间戳
	"limit" => $limit	//最多多少条
	);                              
$data_string = json_encode($data);
$ch = curl_init($api);
curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
curl_setopt($ch, CURLOPT_POSTFIELDS, $data_string);
curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
curl_setopt($ch, CURLOPT_HTTPHEADER, array(      
    'os: android ',
    'version: 5.0.1',   
    'Content-Type: application/json',
    'Content-Length: ' . strlen($data_string)) 
);
$result = curl_exec($ch);
return $result;
}

//live详情
function openlive_get_info ($content,$f,$api=LIVEINFO_API) {
//从api获取
/* $data = array(
//{"type":0,"userId":0,"liveId":"59ef0c440cf22d4b3516e64b"}
	"liveId" => $content["liveId"],	//liveId
	);                              
$data_string = json_encode($data);
$ch = curl_init($api);
curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
curl_setopt($ch, CURLOPT_POSTFIELDS, $data_string);
curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
curl_setopt($ch, CURLOPT_HTTPHEADER, array(      
    'os: android ',
    'version: 5.0.1',   
    'Content-Type: application/json',
    'Content-Length: ' . strlen($data_string)) 
);
$result = curl_exec($ch);
return $result;
*/

//手动解析(提高速度) beta
/* 	"title",
	"subTitle",
	"isReview"
	"startTime",
	"picPath",
	"streamPathHd",
	"streamPathLd",
	"streamPath" */
$info=[];
$groupid2live=[
10=>9999,
11=>2001,
12=>3001,
13=>6001,
14=>8001,
];
$info["title"]=$content["title"];
$info["subTitle"]=$content["subTitle"];
if ($f==1) {
	$info["isReview"]=1;
	$i=$groupid2live[$content["groupId"]]."/".date("Ymd",substr($content["startTime"],0,10))."/".$content["liveId"].".mp4/playlist.m3u8";
	$info["streamPathHd"]="http://ts.snh48.com/vod/z1.chaoqing.".$i;
	$info["streamPathLd"]="http://ts.snh48.com/vod/z1.gaoqing.".$i;
	$info["streamPath"]="http://ts.snh48.com/vod/z1.liuchang.".$i;
} elseif ($f==2) {
	if($content["isOpen"]) {$info["isReview"]=2;} else {$info["isReview"]=0;}
	$i=$groupid2live[$content["groupId"]]."/playlist.m3u8";
	$info["streamPathHd"]="http://hlthls.48.cn/chaoqing/".$i;
	$info["streamPathLd"]="http://hlthls.48.cn/gaoqing/".$i;
	$info["streamPath"]="http://hlthls.48.cn/liuchang/".$i;
}
$info["startTime"]=$content["startTime"];
$info["picPath"]=$content["picPath"];
return $info;
}

//解析数据未来可以考虑在浏览器js完成

//解析数据
function live_print ($result) {
	$data=json_decode($result,true);
	if(!empty($data["content"]["liveList"])){
	echo '<tr><td colspan="8"><span style="color:Red">----------分界线，以下为直播----------</span></td></tr>';
		foreach ($data["content"]["liveList"] as $id => $content) {
		echo '<tr>';
		tablelist($content);
		echo '</tr>';
	}
	}
	if(!empty($data["content"]["reviewList"])){
	echo '<tr><td colspan="8"><span style="color:Red">----------录播分界线，以下为录播----------</span></td></tr>';
	foreach ($data["content"]["reviewList"] as $id => $content) {
		echo '<tr>';
		tablelist($content);
		echo '</tr>';
	}
	}
}

function openlive_print ($result,$f) {
	$data=json_decode($result,true);
	if(!empty($data["content"]["liveList"])) {
	echo '<tr><td colspan="8"><span style="color:Red">----------分界线，以下为公演----------</span></td></tr>';	
	foreach ($data["content"]["liveList"] as $id => $content) {
		$info=openlive_get_info($content,$f);
		
		//$info=json_decode($info,true);
		echo '<tr>';
		tablelist_open($info);
		echo '</tr>';
	}
	}
}
//辅助函数 将公演直播、录播数据提取的内容打印成一列
function tablelist_open($content) {
	global $order_open;
	foreach ($order_open as $key) {
		$value=$content[$key];
		switch ($key) {
			case "streamPathHd": //07超清源
				echo '<td class="t7"><a href="'.$value.'"  target="_blank">'.$value.'</a></td>';
				break;
			case "title": //02标题
				echo '<td class="t2">'.$value.'</td>';
				break;
			case "subTitle": //03副标题
				echo '<td class="t3">'.$value.'</td>';
				break;
			case "picPath": //06配图地址
				echo '<td class="t6">';
				$pics = explode(',',$value);
				foreach ($pics as $values) {
				echo '<img src="'.LIVE_PIC.$values.'" style="max-width:30px; max-height:30px" />';
				};
				echo '</td>';
				break;
			case "startTime": //05直播开始时间
				echo '<td class="t5">'.date("Y-m-d",substr($value,0,10)).'<br />'.date("H:i:s",substr($value,0,10)).'</td>';
				break;
			case "isReview": //04直播类型
				echo '<td class="t4">';
				if ($value==1) {
					echo '录播';
				}
				else if ($value==0) {
					echo '直播';
				}
				else if ($value==2) {
					echo '正在直播';
				} else {
					echo 'U_'.$value;
				}
				echo '</td>';
				break;
			case "streamPath": //09标清源
				echo '<td class="t9"><a href="'.$value.'"  target="_blank">'.$value.'</a></td>';
				break;
			case "streamPathLd": //08高清源
				echo '<td class="t8"><a href="'.$value.'"  target="_blank">'.$value.'</a></td>';
				break;
		}
	}
}

//辅助函数 将直播、录播数据提取的内容打印成一列
function tablelist($content) {
	global $order;
	foreach ($order as $key) {
		$value=$content[$key];
		switch ($key) {
			case "liveId": //07官方地址
				echo '<td class="t7"><a href="'.LIVE_SHARE.$value.'"  target="_blank">'.LIVE_SHARE.$value.'</a></td>';
				break;
			case "title": //02标题
				echo '<td class="t2">'.$value.'</td>';
				break;
			case "subTitle": //03副标题
				echo '<td class="t3">'.$value.'</td>';
				break;
			case "picPath": //06配图地址
				echo '<td class="t6">';
				$pics = explode(',',$value);
				foreach ($pics as $values) {
				echo '<img src="'.LIVE_PIC.$values.'" style="max-width:30px; max-height:30px" />';
				};
				echo '</td>';
				break;
			case "startTime": //05直播开始时间
				echo '<td class="t5">'.date("Y-m-d",substr($value,0,10)).'<br />'.date("H:i:s",substr($value,0,10)).'</td>';
				break;
			case "memberId": //01成员ID
				//echo '<td class="t1">'.$value.'</td>';
				break;
			case "liveType": //04直播类型
				echo '<td class="t4">';
				if ($value=="1") {
					echo '视频';
				}
				else if ($value=="2") {
					echo '电台';
				}
				else {
					echo 'U_'.$value;
				}
				echo '</td>';
				break;
			case "picLoopTime": //10图片循环时间
				//echo '<td class="t10">'.$value.'</td>';
				break;
			case "lrcPath": //09弹幕文件地址
				echo '<td class="t9"><a href="'.LIVE_PIC.$value.'"  target="_blank">'.LIVE_PIC.$value.'</a></td>';
				break;
			case "streamPath": //08视频源地址
				echo '<td class="t8"><a href="'.$value.'"  target="_blank">'.$value.'</a></td>';
				break;
			case "screenMode": //??
				//echo '<td class="t11">'.$value.'</td>';
				break;
		}
	}
}

//打印groupId表
function get_group_table(){
	global $groupinfo;
	foreach ($groupinfo as $groupid => $groupname) {
		echo'<label id="group-'.$groupid.'" class="group">[<input name="g" type="radio" value="'.$groupid.'" />'.$groupname.']</label>';
	}
}
//打印memberId表
function get_member_table(){
	global $teaminfo;
	global $memberinfo;
	foreach ($teaminfo as $teamid=>$teaminfos) {
		//$teaminfos=[groupId,teamName]
		echo '<fieldset class="group-'.$teaminfos[0].' team" style="display: none">';
		echo '<label>【'.$teaminfos[1].'】</label>';
			foreach ($memberinfo as $memberid => $memberinfos) {
				//$memberinfos=[realName,groupId,teamId,periodId,status,firstTeam]
				if ($memberinfos[2]==$teamid&&$memberinfos[4]==1) {
					echo '<label><input name="me" type="radio" value="'.$memberid.'" />'.$memberinfos[0].'</label>';
				}
			}
		echo '</fieldset>';

		
	}
	foreach ($memberinfo as $memberid => $memberinfos) {
		
		
		/*
 		echo '<fieldset id="'.$group.'" style="display: none">';
		foreach ($teams as $team => $members) {
			echo '<fieldset>';
			echo '<label>【Team'.$team.'】</label>';
			foreach ($members as $member => $mid) {
				echo '<label><input name="me" type="radio" value="'.$mid.'" />'.$member.'</label>';
			}
			echo '</fieldset>';
		}
		echo '</fieldset>';
		*/
	}
}

function groupid2name ($groupid) {
	global $groupinfo;
	if($groupinfo[$groupid]!='') {
		return $groupinfo[$groupid];
	}
}
function teamid2name ($teamid) {
	global $teaminfo;
	if(teaminfo[$teamid]!='') {
		return $teaminfo[$teamid];
	}
}
function memberid2name ($memberid) {
	global $memberinfo;
	if(teaminfo[$memberid]!='') {
		return $teaminfo[$memberid];
	}
}

/* groupInfo */
//groupId=>groupName
$groupinfo=[  0=>'全团', 10=>'SNH48', 11=>'BEJ48', 12=>'GNZ48', 13=>'SHY48', 14=>'CKG48', ];

/* teamInfo */
//teamid=>[groupId,teamName]
$teaminfo=[ 0=>[0,'官方'], 1001=>[10,'TEAM SII'], 1002=>[10,'TEAM NII'], 1003=>[10,'TEAM HII'], 1004=>[10,'TEAM X'], 1005=>[10,'TEAM XII'], 1101=>[11,'TEAM B'], 1102=>[11,'TEAM E'], 1103=>[11,'TEAM J'], 1201=>[12,'TEAM G'], 1202=>[12,'TEAM NIII'], 1203=>[12,'TEAM Z'], 1207=>[12,'偶像研究计划'], 1301=>[13,'TEAM SIII'], 1302=>[13,'TEAM HIII'], 1401=>[14,'TEAM C'], 1402=>[14,'TEAM K'], ];

/* memberInfo */
//memberId=>[realName,groupId,teamId,periodId,status,firstTeam]
$memberinfo=[ 1=>['张语格',10,1001,1001,1,1001], 2=>['赵嘉敏',10,1001,1001,2,1001], 3=>['陈观慧',10,1001,1001,1,1001], 4=>['陈佳莹',10,1002,1002,1,1002], 5=>['袁雨桢',10,1001,1002,1,1001], 6=>['董艳芸',10,1002,1002,2,1002], 7=>['冯薪朵',10,1002,1002,1,1002], 8=>['孙芮',10,1001,1002,1,1001], 9=>['沈之琳',10,1001,1002,1,1001], 10=>['何晓玉',10,1002,1002,1,1002], 11=>['温晶婕',10,1001,1002,1,1001], 12=>['唐安琪',10,1002,1002,2,1002], 13=>['罗兰',10,1002,1002,2,1002], 14=>['徐子轩',10,1001,1002,1,1001], 15=>['孟玥',10,1002,1002,2,1002], 16=>['李艺彤',10,1002,1002,1,1002], 17=>['蒋芸',10,1001,1002,1,1001], 18=>['徐晨辰',10,1001,1001,1,1001], 19=>['孔肖吟',10,1001,1001,1,1001], 20=>['李宇琪',10,1001,1001,1,1001], 21=>['许佳琪',10,1001,1001,1,1001], 22=>['黄婷婷',10,1002,1002,1,1002], 24=>['林思意',10,1002,1002,1,1002], 25=>['万丽娜',10,1002,1002,1,1002], 26=>['龚诗淇',10,1002,1002,1,1002], 27=>['赵粤',10,1002,1002,1,1002], 28=>['李清扬',10,1003,1003,1,1003], 32=>['郝婉晴',10,1003,1003,1,1003], 33=>['易嘉爱',10,1002,1002,1,1002], 34=>['陆婷',10,1002,1002,1,1002], 35=>['莫寒',10,1001,1001,1,1001], 36=>['钱蓓婷',10,1001,1001,1,1001], 37=>['陈思',10,1001,1001,1,1001], 38=>['戴萌',10,1001,1001,1,1001], 39=>['吴哲晗',10,1001,1001,1,1001], 40=>['邱欣怡',10,1001,1001,1,1001], 43=>['徐伊人',10,1003,1003,1,1003], 45=>['谢妮',10,1003,1003,1,1003], 46=>['刘佩鑫',10,1003,1003,1,1003], 47=>['王柏硕',10,1003,1003,1,1003], 48=>['鞠婧祎',10,1002,1002,1,1002], 49=>['曾艳芬',10,1002,1002,1,1002], 53=>['袋王2',10,1002,0,99,1002], 63=>['袋王',10,0,0,1,0], 67=>['袁丹妮',10,1001,1003,1,1001], 68=>['陈问言',10,1002,1002,1,1002], 1544=>['刘炅然',10,1003,1003,1,1003], 2470=>['徐晗',10,1003,1003,1,1003], 2508=>['张昕',10,1003,1003,1,1003], 5526=>['袋王4',10,1001,0,99,1001], 5527=>['袋王5',10,1001,0,99,1001], 5560=>['陈怡馨',10,1003,1003,2,1003], 5561=>['李豆豆',10,1003,1003,-1,1003], 5562=>['林楠',10,1003,1003,1,1003], 5563=>['王璐',10,1003,1003,2,1003], 5564=>['吴燕文',10,1003,1003,1,1003], 5566=>['许杨玉琢',10,1003,1003,1,1003], 5567=>['杨惠婷',10,1003,1003,1,1003], 5574=>['张雨鑫',10,1002,1003,1,1002], 5973=>['SNH48',10,0,0,1,0], 6429=>['赵晔',10,1001,1003,1,1001], 6431=>['陈琳',10,1004,1004,1,1004], 6432=>['冯晓菲',10,1004,1004,1,1004], 6734=>['李晶',10,1004,1004,1,1004], 6735=>['李钊',10,1004,1004,1,1004], 6736=>['孙静怡',10,1004,1004,-1,0], 6737=>['邵雪聪',10,1004,1004,1,1004], 6738=>['宋昕冉',10,1004,1004,1,1004], 6739=>['孙歆文',10,1004,1004,1,1004], 6740=>['汪佳翎',10,1004,1004,1,1004], 6741=>['汪束',10,1004,1004,1,1004], 6742=>['王晓佳',10,1004,1004,1,1004], 6743=>['谢天依',10,1004,1004,1,1004], 6744=>['杨冰怡',10,1004,1004,1,1004], 6745=>['闫明筠',11,1101,1004,1,1101], 6746=>['杨韫玉',10,1004,1004,1,1004], 6747=>['张丹三',10,1004,1004,1,1004], 6749=>['张韵雯',10,1004,1004,-1,1004], 9073=>['影视君',10,0,0,1,0], 48995=>['刘力玮',10,1001,1005,-1,1001], 48997=>['申月姣',10,1001,1005,-1,1001], 48998=>['徐佳丽',11,1101,1005,2,1101], 49000=>['刘诗蕾',10,1002,1005,-1,1002], 49003=>['周怡',10,1002,1005,1,1002], 49005=>['沈梦瑶',10,1003,1005,1,1003], 49006=>['王露皎',14,1402,1005,1,1003], 49007=>['袁航',10,1003,1005,1,1003], 63548=>['陈珂',12,1201,1005,1,1005], 63549=>['陈美君',11,1101,1005,1,1101], 63550=>['陈音',10,1005,1005,2,1005], 63551=>['陈韫凌',10,1005,1005,1,1005], 63552=>['陈雨琪',12,1201,1005,1,1005], 63553=>['杜雨微',12,1201,1005,1,1005], 63554=>['段艺璇',11,1101,1005,1,1101], 63555=>['费沁源',10,1005,1005,1,1005], 63556=>['冯雪莹',11,1101,1005,2,1101], 63557=>['高源婧',12,1201,1005,1,1005], 63558=>['洪珮雲',10,1005,1005,1,1005], 63559=>['胡晓慧',11,1101,1005,1,1101], 63560=>['姜杉',10,1005,1005,1,1005], 63561=>['蒋舒婷',10,1005,1005,1,1005], 63562=>['林嘉佩',12,1201,1005,1,1005], 63563=>['刘梦雅',12,1201,1005,1,1005], 63564=>['李沁洁',12,1201,1005,1,1005], 63565=>['刘筱筱',12,1201,1005,1,1005], 63566=>['刘增艳',10,1005,1005,1,1005], 63567=>['潘瑛琪',10,1005,1005,1,1005], 63568=>['宋思娴',11,1101,1005,1,1101], 63569=>['时语婕',10,1005,1005,-1,1005], 63570=>['宋雨珊',10,1005,1005,1,1005], 63571=>['田姝丽',11,1101,1005,1,1101], 63572=>['谢蕾蕾',12,1201,1005,1,1005], 63573=>['熊素君',11,1101,1005,1,1101], 63574=>['严佼君',10,1005,1005,1,1005], 63575=>['於佳怡',10,1005,1005,1,1005], 63576=>['阳青颖',12,1201,1005,1,1005], 63577=>['曾艾佳',12,1201,1005,1,1005], 63578=>['张菡筱',11,1101,1005,2,1101], 63579=>['邹佳佳',10,1005,1005,2,1005], 63580=>['张凯祺',12,1201,1005,1,1005], 63581=>['张文静',10,1005,1005,1,1005], 63582=>['张怡',10,1005,1005,1,1005], 68795=>['袋王活动1',10,1001,0,99,1001], 286973=>['成珏',10,1001,1006,1,1001], 286974=>['钱艺',10,1002,1006,-1,1002], 286975=>['邓艳秋菲',10,1002,1006,-1,1002], 286976=>['黄彤扬',10,1002,1006,1,1002], 286977=>['孙珍妮',10,1003,1006,1,1003], 286978=>['王金铭',13,1302,1006,1,1003], 286979=>['张嘉予',10,1004,1006,1,1004], 286980=>['林忆宁',10,1004,1006,1,1004], 286982=>['吕梦莹',10,1005,1006,1,1005], 286983=>['李佳恩',10,1005,1006,1,1005], 286984=>['程文路',10,1005,1006,-1,1005], 327557=>['胡怡莹',12,1201,1006,2,1006], 327558=>['罗寒月',12,1201,1006,1,1006], 327559=>['王馨悦',12,1201,1206,2,1201], 327560=>['张琼予',12,1201,1006,1,1006], 327561=>['周倩玉',12,1201,1006,2,1006], 327562=>['陈慧婧',12,1202,1006,1,1006], 327563=>['陈楠茜',12,1202,1006,1,1006], 327564=>['陈欣妤',12,1202,1006,1,1006], 327565=>['冯嘉希',12,1202,1006,1,1006], 327566=>['洪静雯',12,1202,1006,1,1006], 327567=>['刘力菲',12,1202,1006,1,1006], 327568=>['刘倩倩',12,1202,1006,1,1006], 327569=>['卢静',12,1202,1006,1,1006], 327570=>['孙馨',12,1202,1006,1,1006], 327571=>['唐莉佳',12,1202,1006,1,1006], 327572=>['冼燊楠',12,1202,1006,1,1006], 327573=>['肖文铃',12,1202,1006,1,1006], 327574=>['熊心瑶',12,1202,1006,1,1006], 327575=>['郑丹妮',12,1202,1006,1,1006], 327576=>['左嘉欣',12,1202,1006,1,1006], 327577=>['左婧媛',12,1202,1006,1,1006], 327578=>['林溪荷',11,1101,1006,1,1101], 327579=>['刘姝贤',11,1101,1006,1,1101], 327580=>['张梦慧',11,1101,1006,1,1101], 327581=>['青钰雯',11,1101,1006,1,1101], 327582=>['孙姗',11,1101,1006,1,1101], 327583=>['文妍',11,1101,1006,2,1101], 327584=>['胡博文',11,1101,1006,2,1101], 327585=>['夏越',11,1101,1006,1,1101], 327586=>['牛聪聪',11,1101,1006,1,1101], 327587=>['冯思佳',11,1102,1006,1,1102], 327588=>['陈姣荷',11,1102,1006,1,1102], 327589=>['罗雪丽',11,1102,1006,1,1102], 327590=>['毕梦媛',11,1102,1006,2,1102], 327591=>['李梓',11,1102,1006,1,1102], 327592=>['李媛媛',11,1102,1006,1,1102], 327593=>['李诗彦',11,1102,1006,2,1102], 327594=>['李想',11,1102,1006,1,1102], 327595=>['郑一凡',11,1102,1006,1,1102], 327596=>['马玉灵',11,1102,1006,1,1102], 327597=>['苏杉杉',11,1102,1006,1,1102], 327598=>['张笑盈',11,1102,1006,1,1102], 327599=>['林堃',11,1102,1006,2,1102], 327600=>['顼凘炀',11,1102,1006,1,1102], 327601=>['陈倩楠',11,1102,1006,1,1102], 327602=>['刘胜男',11,1102,1006,1,1102], 327603=>['易妍倩',11,1102,1006,2,1102], 327682=>['BEJ48',11,0,0,1,0], 327683=>['GNZ48',12,0,0,1,0], 399631=>['吕一',10,1001,1007,1,1001], 399652=>['潘燕琦',10,1001,1007,1,1001], 399654=>['赵韩倩',10,1001,1007,1,1001], 399657=>['徐真',10,1002,1007,2,1002], 399662=>['江真仪',10,1002,1007,1,1002], 399664=>['刘菊子',10,1002,1007,1,1002], 399665=>['张雅梦',10,1002,1007,1,1002], 399667=>['刘瀛',10,1002,1007,1,1002], 399668=>['许逸',10,1002,1007,1,1002], 399669=>['袁一琦',10,1003,1007,1,1003], 399672=>['祁静',10,1004,1007,1,1004], 399673=>['曾晓雯',10,1005,1007,1,1005], 399674=>['徐诗琪',10,1005,1007,1,1005], 407071=>['吴月黎',11,1101,1101,2,1101], 407077=>['陈逸菲',11,1101,1101,2,1101], 407101=>['陈雅钰',11,1103,1101,1,1103], 407103=>['房蕾',11,1103,1101,1,1103], 407104=>['葛司琪',11,1103,1101,1,1103], 407106=>['黄恩茹',11,1103,1101,1,1103], 407108=>['李泓瑶',11,1103,1101,1,1103], 407110=>['刘闲',11,1103,1101,1,1103], 407112=>['任心怡',11,1103,1101,1,1103], 407114=>['任玥霖',11,1103,1101,1,1103], 407118=>['单习文',11,1103,1101,2,1103], 407119=>['石羽莎',11,1103,1101,1,1103], 407121=>['孙语姗',11,1103,1101,1,1103], 407124=>['叶苗苗',11,1103,1101,1,1103], 407126=>['杨晔',11,1103,1101,1,1103], 407127=>['张怀瑾',11,1103,1101,1,1103], 407130=>['张韩紫陌',11,1103,1101,1,1103], 407132=>['李娜',11,1102,1101,1,1102], 407135=>['杨一帆',11,1102,1101,1,1102], 407168=>['王雨煊',11,1103,1101,1,1103], 410175=>['黄黎蓉',12,1201,1201,1,1201], 410177=>['向芸',12,1201,1201,2,1201], 410179=>['戴欣佚',12,1202,1201,2,1202], 410180=>['李伊虹',12,1202,1201,1,1202], 411040=>['尼德兰的微笑',10,0,0,1,0], 417311=>['陈桂君',12,1203,1201,1,1203], 417315=>['陈梓荧',12,1203,1201,1,1203], 417316=>['代玲',12,1203,1201,1,1203], 417317=>['杜秋霖',12,1203,1201,1,1203], 417318=>['刘嘉怡',12,1203,1201,1,1203], 417320=>['龙亦瑞',12,1203,1201,1,1203], 417321=>['农燕萍',12,1203,1201,1,1203], 417324=>['王翠菲',12,1203,1201,1,1203], 417325=>['王炯义',12,1203,1201,1,1203], 417326=>['王偲越',12,1203,1201,1,1203], 417328=>['王盈',12,1203,1201,1,1203], 417329=>['王秭歆',12,1203,1201,1,1203], 417330=>['杨可璐',12,1203,1201,1,1203], 417331=>['杨媛媛',12,1203,1201,1,1203], 417332=>['于珊珊',12,1203,1201,1,1203], 417333=>['张心雨',12,1203,1201,1,1203], 417335=>['赵欣雨',12,1203,1201,1,1203], 417336=>['赵翊民',12,1203,1201,1,1203], 419966=>['姚祎纯',10,1004,1007,1,1004], 443031=>['悠游甜心A',10,0,0,99,0], 443032=>['悠游甜心B',10,0,0,0,0], 444081=>['许婉玉',11,1103,1101,1,1103], 458335=>['李慧',13,1301,1301,1,1301], 458358=>['南翎璞',13,1301,1301,1,1301], 459988=>['徐静妍',13,1301,1301,1,1301], 459989=>['王诗蒙',13,1301,1301,1,1301], 459991=>['卢天惠',13,1301,1301,1,1301], 459992=>['刘娜',13,1301,1301,1,1301], 459993=>['刘娇',13,1301,1301,1,1301], 459994=>['秦玺',13,1301,1301,1,1301], 459995=>['赖梓惜',13,1301,1301,1,1301], 459996=>['关思雨',13,1301,1301,1,1301], 459997=>['朱燕',13,1301,1301,1,1301], 459999=>['韩家乐',13,1301,1301,1,1301], 460000=>['陈婧文',13,1301,1301,1,1301], 460002=>['付紫琪',13,1301,1301,1,1301], 460003=>['冯译莹',13,1301,1301,1,1301], 460004=>['杨允涵',13,1301,1301,1,1301], 460005=>['赵佳蕊',13,1301,1301,1,1301], 460007=>['孙敏',13,1301,1301,1,1301], 460933=>['SHY48',13,0,0,1,0], 480656=>['董思佳',13,1302,1301,1,1302], 480665=>['高志娴',13,1302,1301,1,1302], 480666=>['寇承希',13,1302,1301,1,1302], 480667=>['刘静晗',13,1302,1301,1,1302], 480668=>['李晴',13,1302,1301,1,1302], 480670=>['李熙凝',13,1302,1301,1,1302], 480671=>['曲悦萌',13,1302,1301,1,1302], 480672=>['任雨情',13,1302,1301,1,1302], 480673=>['徐斐然',13,1302,1301,1,1302], 480674=>['杨肖',13,1302,1301,1,1302], 480675=>['张爱静',13,1302,1301,1,1302], 480676=>['郑洁丽',13,1302,1301,1,1302], 480678=>['张儒轶',13,1302,1301,1,1302], 480679=>['张云梦',13,1302,1301,1,1302], 480680=>['张幼柠',13,1302,1301,2,1302], 485376=>['澳洲行活动一',10,0,0,99,0], 485380=>['澳洲行活动二',10,0,0,99,0], 485381=>['澳洲行活动三',10,0,0,99,0], 490333=>['7SENSES',10,0,0,1,0], 524597=>['GNZ48-星梦剧院',12,0,0,1,0], 526172=>['SNH48-星梦剧院',10,0,0,1,0], 528094=>['胡丽芝',11,1101,1102,1,0], 528101=>['刘崇恬',11,1101,1102,1,0], 528106=>['李沐遥',11,1101,1102,1,0], 528118=>['毛其羽',11,1101,1102,1,0], 528329=>['孙晓艳',11,1101,1102,1,0], 528330=>['郑依灵',11,1101,1102,1,0], 528331=>['黄子璇',11,1102,1102,1,0], 528332=>['李烨',11,1102,1102,2,0], 528333=>['徐静',11,1102,1102,1,0], 528334=>['赵笛儿',11,1102,1102,1,0], 528335=>['金锣赛',11,1103,1102,1,0], 528336=>['兰昊',11,1103,1102,1,0], 528337=>['刘一菲',11,1103,1102,1,0], 528339=>['乔钰珂',11,1103,1102,1,0], 528340=>['郑心雨',11,1103,1102,2,0], 529287=>['48WAN游戏平台',10,0,0,1,0], 529991=>['陈奕君',13,1301,1302,1,0], 530378=>['菅瑞静',13,1301,1302,1,0], 530380=>['叶锦童',13,1301,1302,1,0], 530381=>['臧聪',13,1301,1302,1,0], 530383=>['郑诗琪',13,1301,1302,1,0], 530384=>['方诗涵',13,1302,1302,1,0], 530385=>['高崇',13,1302,1302,1,0], 530386=>['龚梦婷',13,1302,1302,1,0], 530387=>['逯芳竹',13,1302,1302,1,0], 530388=>['王菲妍',13,1302,1302,1,0], 530390=>['王睿琦',13,1302,1302,1,0], 530392=>['张羽涵',13,1302,1302,1,0], 530431=>['陈佳莹',12,1201,1202,1,0], 530433=>['陈俊宏',12,1201,1202,1,0], 530434=>['陈乐添',12,1201,1202,1,0], 530435=>['程一心',12,1201,1202,1,0], 530436=>['方晓瑜',12,1201,1202,1,0], 530439=>['高雪逸',12,1202,1202,1,0], 530440=>['赖俊亦',12,1203,1202,1,0], 530443=>['梁可',12,1201,1202,1,0], 530444=>['刘小末',12,1201,1202,1,0], 530446=>['唐诗怡',12,1202,1202,1,0], 530447=>['谢艾琳',12,1202,1202,1,0], 530450=>['张秋怡',12,1203,1202,1,0], 530451=>['郑悦',12,1202,1202,1,0], 530452=>['朱怡欣',12,1201,1202,1,0], 530584=>['郭倩芸',10,1003,1008,1,0], 533852=>['陶波尔',10,1005,1008,1,0], 534729=>['文文',10,1003,1008,1,0], 538697=>['沈小爱',11,1101,1102,1,0], 538735=>['金莹玥',10,1002,1008,1,0], 540106=>['赵梦婷',10,1003,1008,1,0], 541132=>['林歆源',10,1005,1008,1,0], 565225=>['CKG48',14,0,0,1,0], 592320=>['贺苏堃',10,1005,1008,0,0], 592348=>['许嘉怡',10,1005,1008,1,0], 593820=>['孙亚萍',10,1004,1008,1,0], 593999=>['葛佳慧',10,1002,1008,1,0], 594002=>['姜涵',10,1003,1008,1,0], 594003=>['王奕',10,1003,1008,1,0], 594005=>['熊沁娴',10,1003,1008,1,0], 601302=>['梁婉琳',12,1207,1203,1,0], 606343=>['马凡',10,1002,1008,1,0], 607507=>['毕瑞珊',12,1207,1203,1,0], 607510=>['程子钰',12,1207,1203,1,0], 607511=>['邓惠恩',12,1207,1203,1,0], 607513=>['符冰冰',12,1207,1203,1,0], 607515=>['黄楚茵',12,1207,1203,1,0], 607516=>['何梦瑶',12,1207,1203,1,0], 607521=>['罗可嘉',12,1207,1203,1,0], 607523=>['林芝',12,1207,1203,1,0], 607524=>['汪慕远',12,1207,1203,1,0], 607591=>['吴羽霏',12,1207,1203,1,0], 607592=>['叶晓梦',12,1207,1203,1,0], 607594=>['余芷媛',12,1207,1203,1,0], 608995=>['李彬玉',13,1301,1303,1,0], 608997=>['司珀琳',13,1301,1303,1,0], 609001=>['周佳怡',13,1301,1303,1,0], 609002=>['赵天杨',13,1301,1303,1,0], 613487=>['朱星宇',14,0,1008,0,0], 614528=>['柏欣妤',14,1401,1401,1,0], 614725=>['李恩锐',14,1401,1401,1,0], 614727=>['李姗姗',14,1401,1401,1,0], 614728=>['雷宇霄',14,1401,1401,1,0], 614729=>['李泽亚',14,1401,1401,1,0], 614730=>['孟玥',14,1401,1401,1,0], 614731=>['毛译晗',14,1401,1401,1,0], 614733=>['谯玉珍',14,1401,1401,1,0], 614734=>['冉蔚',14,1401,1401,1,0], 614735=>['田倩兰',14,1401,1401,1,0], 614736=>['陶菀瑞',14,1401,1401,1,0], 614738=>['伍寒琪',14,1401,1401,1,0], 614739=>['王梦竹',14,1401,1401,1,0], 614740=>['王娱博',14,1401,1401,1,0], 614741=>['曾佳',14,1401,1401,1,0], 614742=>['左欣',14,1401,1401,1,0], 614743=>['周源',14,1401,1401,1,0], 614749=>['艾芷亦',14,1402,1401,1,0], 614750=>['邓倩',14,1402,1401,1,0], 614752=>['樊曦月',14,1402,1401,1,0], 614753=>['郝婧怡',14,1402,1401,1,0], 614754=>['韩林芹',14,1402,1401,1,0], 614755=>['黄琬璎',14,1402,1401,1,0], 614756=>['林舒晴',14,1402,1401,1,0], 614757=>['李瑜璇',14,1402,1401,1,0], 614758=>['石勤',14,1402,1401,1,0], 614760=>['田祯臻',14,1402,1401,1,0], 614761=>['吴学雨',14,1402,1401,1,0], 614762=>['夏文倩',14,1402,1401,1,0], 614770=>['章宇阳',14,1402,1401,1,0], 614772=>['郑阳莹',14,1402,1401,1,0], 614773=>['赵泽慧',14,1402,1401,1,0], 614776=>['吴晶晶',14,1402,1401,1,0], ];
?>